###################################################################

# Created by write_sdc on Thu Dec 21 23:17:57 2023

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports clk1]
set_driving_cell -lib_cell INVX1TS [get_ports clk2]
set_driving_cell -lib_cell INVX1TS [get_ports rstn]
set_driving_cell -lib_cell INVX1TS [get_ports {din[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports valid_in]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cload[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cload[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cload[0]}]
set_load -pin_load 0.005 [get_ports {dout[15]}]
set_load -pin_load 0.005 [get_ports {dout[14]}]
set_load -pin_load 0.005 [get_ports {dout[13]}]
set_load -pin_load 0.005 [get_ports {dout[12]}]
set_load -pin_load 0.005 [get_ports {dout[11]}]
set_load -pin_load 0.005 [get_ports {dout[10]}]
set_load -pin_load 0.005 [get_ports {dout[9]}]
set_load -pin_load 0.005 [get_ports {dout[8]}]
set_load -pin_load 0.005 [get_ports {dout[7]}]
set_load -pin_load 0.005 [get_ports {dout[6]}]
set_load -pin_load 0.005 [get_ports {dout[5]}]
set_load -pin_load 0.005 [get_ports {dout[4]}]
set_load -pin_load 0.005 [get_ports {dout[3]}]
set_load -pin_load 0.005 [get_ports {dout[2]}]
set_load -pin_load 0.005 [get_ports {dout[1]}]
set_load -pin_load 0.005 [get_ports {dout[0]}]
set_max_capacitance 0.005 [get_ports clk1]
set_max_capacitance 0.005 [get_ports clk2]
set_max_capacitance 0.005 [get_ports rstn]
set_max_capacitance 0.005 [get_ports {din[15]}]
set_max_capacitance 0.005 [get_ports {din[14]}]
set_max_capacitance 0.005 [get_ports {din[13]}]
set_max_capacitance 0.005 [get_ports {din[12]}]
set_max_capacitance 0.005 [get_ports {din[11]}]
set_max_capacitance 0.005 [get_ports {din[10]}]
set_max_capacitance 0.005 [get_ports {din[9]}]
set_max_capacitance 0.005 [get_ports {din[8]}]
set_max_capacitance 0.005 [get_ports {din[7]}]
set_max_capacitance 0.005 [get_ports {din[6]}]
set_max_capacitance 0.005 [get_ports {din[5]}]
set_max_capacitance 0.005 [get_ports {din[4]}]
set_max_capacitance 0.005 [get_ports {din[3]}]
set_max_capacitance 0.005 [get_ports {din[2]}]
set_max_capacitance 0.005 [get_ports {din[1]}]
set_max_capacitance 0.005 [get_ports {din[0]}]
set_max_capacitance 0.005 [get_ports valid_in]
set_max_capacitance 0.005 [get_ports {cin[15]}]
set_max_capacitance 0.005 [get_ports {cin[14]}]
set_max_capacitance 0.005 [get_ports {cin[13]}]
set_max_capacitance 0.005 [get_ports {cin[12]}]
set_max_capacitance 0.005 [get_ports {cin[11]}]
set_max_capacitance 0.005 [get_ports {cin[10]}]
set_max_capacitance 0.005 [get_ports {cin[9]}]
set_max_capacitance 0.005 [get_ports {cin[8]}]
set_max_capacitance 0.005 [get_ports {cin[7]}]
set_max_capacitance 0.005 [get_ports {cin[6]}]
set_max_capacitance 0.005 [get_ports {cin[5]}]
set_max_capacitance 0.005 [get_ports {cin[4]}]
set_max_capacitance 0.005 [get_ports {cin[3]}]
set_max_capacitance 0.005 [get_ports {cin[2]}]
set_max_capacitance 0.005 [get_ports {cin[1]}]
set_max_capacitance 0.005 [get_ports {cin[0]}]
set_max_capacitance 0.005 [get_ports {caddr[5]}]
set_max_capacitance 0.005 [get_ports {caddr[4]}]
set_max_capacitance 0.005 [get_ports {caddr[3]}]
set_max_capacitance 0.005 [get_ports {caddr[2]}]
set_max_capacitance 0.005 [get_ports {caddr[1]}]
set_max_capacitance 0.005 [get_ports {caddr[0]}]
set_max_capacitance 0.005 [get_ports {cload[2]}]
set_max_capacitance 0.005 [get_ports {cload[1]}]
set_max_capacitance 0.005 [get_ports {cload[0]}]
set_max_fanout 4 [get_ports clk1]
set_max_fanout 4 [get_ports clk2]
set_max_fanout 4 [get_ports rstn]
set_max_fanout 4 [get_ports {din[15]}]
set_max_fanout 4 [get_ports {din[14]}]
set_max_fanout 4 [get_ports {din[13]}]
set_max_fanout 4 [get_ports {din[12]}]
set_max_fanout 4 [get_ports {din[11]}]
set_max_fanout 4 [get_ports {din[10]}]
set_max_fanout 4 [get_ports {din[9]}]
set_max_fanout 4 [get_ports {din[8]}]
set_max_fanout 4 [get_ports {din[7]}]
set_max_fanout 4 [get_ports {din[6]}]
set_max_fanout 4 [get_ports {din[5]}]
set_max_fanout 4 [get_ports {din[4]}]
set_max_fanout 4 [get_ports {din[3]}]
set_max_fanout 4 [get_ports {din[2]}]
set_max_fanout 4 [get_ports {din[1]}]
set_max_fanout 4 [get_ports {din[0]}]
set_max_fanout 4 [get_ports valid_in]
set_max_fanout 4 [get_ports {cin[15]}]
set_max_fanout 4 [get_ports {cin[14]}]
set_max_fanout 4 [get_ports {cin[13]}]
set_max_fanout 4 [get_ports {cin[12]}]
set_max_fanout 4 [get_ports {cin[11]}]
set_max_fanout 4 [get_ports {cin[10]}]
set_max_fanout 4 [get_ports {cin[9]}]
set_max_fanout 4 [get_ports {cin[8]}]
set_max_fanout 4 [get_ports {cin[7]}]
set_max_fanout 4 [get_ports {cin[6]}]
set_max_fanout 4 [get_ports {cin[5]}]
set_max_fanout 4 [get_ports {cin[4]}]
set_max_fanout 4 [get_ports {cin[3]}]
set_max_fanout 4 [get_ports {cin[2]}]
set_max_fanout 4 [get_ports {cin[1]}]
set_max_fanout 4 [get_ports {cin[0]}]
set_max_fanout 4 [get_ports {caddr[5]}]
set_max_fanout 4 [get_ports {caddr[4]}]
set_max_fanout 4 [get_ports {caddr[3]}]
set_max_fanout 4 [get_ports {caddr[2]}]
set_max_fanout 4 [get_ports {caddr[1]}]
set_max_fanout 4 [get_ports {caddr[0]}]
set_max_fanout 4 [get_ports {cload[2]}]
set_max_fanout 4 [get_ports {cload[1]}]
set_max_fanout 4 [get_ports {cload[0]}]
set_ideal_network [get_ports clk1]
set_ideal_network [get_ports clk2]
create_clock [get_ports clk1]  -period 100000  -waveform {0 50000}
set_clock_uncertainty 0  [get_clocks clk1]
set_clock_transition -max -rise 0.01 [get_clocks clk1]
set_clock_transition -max -fall 0.01 [get_clocks clk1]
set_clock_transition -min -rise 0.01 [get_clocks clk1]
set_clock_transition -min -fall 0.01 [get_clocks clk1]
create_clock [get_ports clk2]  -period 1000  -waveform {0 500}
set_clock_uncertainty 0  [get_clocks clk2]
set_clock_transition -max -rise 0.01 [get_clocks clk2]
set_clock_transition -max -fall 0.01 [get_clocks clk2]
set_clock_transition -min -rise 0.01 [get_clocks clk2]
set_clock_transition -min -fall 0.01 [get_clocks clk2]
set_input_delay -clock clk2  0.05  [get_ports clk1]
set_input_delay -clock clk2  0.05  [get_ports rstn]
set_input_delay -clock clk2  0.05  [get_ports {din[15]}]
set_input_delay -clock clk2  0.05  [get_ports {din[14]}]
set_input_delay -clock clk2  0.05  [get_ports {din[13]}]
set_input_delay -clock clk2  0.05  [get_ports {din[12]}]
set_input_delay -clock clk2  0.05  [get_ports {din[11]}]
set_input_delay -clock clk2  0.05  [get_ports {din[10]}]
set_input_delay -clock clk2  0.05  [get_ports {din[9]}]
set_input_delay -clock clk2  0.05  [get_ports {din[8]}]
set_input_delay -clock clk2  0.05  [get_ports {din[7]}]
set_input_delay -clock clk2  0.05  [get_ports {din[6]}]
set_input_delay -clock clk2  0.05  [get_ports {din[5]}]
set_input_delay -clock clk2  0.05  [get_ports {din[4]}]
set_input_delay -clock clk2  0.05  [get_ports {din[3]}]
set_input_delay -clock clk2  0.05  [get_ports {din[2]}]
set_input_delay -clock clk2  0.05  [get_ports {din[1]}]
set_input_delay -clock clk2  0.05  [get_ports {din[0]}]
set_input_delay -clock clk2  0.05  [get_ports valid_in]
set_input_delay -clock clk2  0.05  [get_ports {cin[15]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[14]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[13]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[12]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[11]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[10]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[9]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[8]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[7]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[6]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[5]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[4]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[3]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[2]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[1]}]
set_input_delay -clock clk2  0.05  [get_ports {cin[0]}]
set_input_delay -clock clk2  0.05  [get_ports {caddr[5]}]
set_input_delay -clock clk2  0.05  [get_ports {caddr[4]}]
set_input_delay -clock clk2  0.05  [get_ports {caddr[3]}]
set_input_delay -clock clk2  0.05  [get_ports {caddr[2]}]
set_input_delay -clock clk2  0.05  [get_ports {caddr[1]}]
set_input_delay -clock clk2  0.05  [get_ports {caddr[0]}]
set_input_delay -clock clk2  0.05  [get_ports {cload[2]}]
set_input_delay -clock clk2  0.05  [get_ports {cload[1]}]
set_input_delay -clock clk2  0.05  [get_ports {cload[0]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[15]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[14]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[13]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[12]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[11]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[10]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[9]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[8]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[7]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[6]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[5]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[4]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[3]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[2]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[1]}]
set_output_delay -clock clk2  0.05  [get_ports {dout[0]}]
